In [65]:
import pandas as pd
url = 'https://statranker.org/cities-urban-life/top-100-cities-by-international-tourist-arrivals-2025/'
df = pd.read_html(url)

In [66]:
import pandas as pd

df_combined = pd.concat(df, ignore_index=True)

target_cities = [
    "Paris", "Barcelona", "Tokyo", "New York", "London",
    "Rome", "Amsterdam", "Sydney", "Bangkok", "Istanbul",
    "Cairo", "Rio de Janeiro", "Venice", "Los Angeles"
]
df_combined['City'] = df_combined['City, Country'].apply(lambda x: x.split(",")[0].strip())

df_filtered = df_combined[df_combined['City'].isin(target_cities)].copy()

df_filtered['International Tourist Arrivals (2025)'] = (
    df_filtered['International Tourist Arrivals (2025)']
    .str.replace('≈','')
    .str.replace('M','')
    .str.strip()
    .astype(float)
)

df_filtered.reset_index(drop=True, inplace=True)

print(df_filtered[['City', 'International Tourist Arrivals (2025)']])

              City  International Tourist Arrivals (2025)
0          Bangkok                                   30.3
1           London                                   22.7
2         Istanbul                                   19.7
3            Paris                                   18.3
4          Bangkok                                   30.3
5           London                                   22.7
6         Istanbul                                   19.7
7            Paris                                   18.3
8            Tokyo                                   15.4
9        Barcelona                                   14.6
10            Rome                                   14.0
11       Amsterdam                                   12.2
12          Venice                                   10.6
13     Los Angeles                                    3.6
14  Rio de Janeiro                                    3.2
15           Cairo                                    2.5
16          Sydney                                    2.5

In [67]:
df_filtered.head()

,Rank,"City, Country",International Tourist Arrivals (2025),City
0,1,"Bangkok, Thailand",30.3,Bangkok
1,3,"London, United Kingdom",22.7,London
2,5,"Istanbul, Türkiye",19.7,Istanbul
3,9,"Paris, France",18.3,Paris
4,1,"Bangkok, Thailand",30.3,Bangkok

In [68]:
df_filtered.drop(columns=["City, Country","Rank"],axis=1)

    International Tourist Arrivals (2025)            City
0                                    30.3         Bangkok
1                                    22.7          London
2                                    19.7        Istanbul
3                                    18.3           Paris
4                                    30.3         Bangkok
5                                    22.7          London
6                                    19.7        Istanbul
7                                    18.3           Paris
8                                    15.4           Tokyo
9                                    14.6       Barcelona
10                                   14.0            Rome
11                                   12.2       Amsterdam
12                                   10.6          Venice
13                                    3.6     Los Angeles
14                                    3.2  Rio de Janeiro
15                                    2.5           Cairo
16                                    2.5          Sydney

In [70]:
df_filtered = df_filtered[['City', 'International Tourist Arrivals (2025)']].copy()
df_filtered.columns = ["City", "International Tourist Arrivals (Millions)"]
df_filtered = df_filtered[['International Tourist Arrivals (Millions)', 'City']]

In [75]:
df_filtered.head()

   International Tourist Arrivals (Millions)      City
0                                       30.3   Bangkok
1                                       22.7    London
2                                       19.7  Istanbul
3                                       18.3     Paris
4                                       30.3   Bangkok

In [73]:
df_filtered.to_csv("TouristArrivals.csv", index=False)